Revit 2024 API
BuiltInFailures.FabricFailures.FabricAreaWrongSheetAlignment Property
 Fabric Area Sheet Alignment is incorrect. Can't create Fabric Area.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FabricAreaWrongSheetAlignment { get; }
Visual Basic
Public Shared ReadOnly Property FabricAreaWrongSheetAlignment As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FabricAreaWrongSheetAlignment {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FabricFailures Class
Autodesk.Revit.DB Namespace